[
    {
        "name": "Pokemon Rojo/ azul/ amarillo",
        "year": 1999,
        "director": "Satoshi Tajiri",
        "pic_sm": "Gens_01.jpg",
        "pic_lg": "Gena_01.png",
        "trailer": "https://www.youtube.com/watch?v=WP4R-wVeT9s&ab_channel=pokemonfreak907",
        "description": "El jugador toma el mando de un niño que vive en Pueblo Paleta, y ha cumplido la edad para poder irse de su casa y dedicarse a entrenar Pokémon. El nombre del protagonista puede ser escogido por el jugador, aunque su nombre genérico es Rojo. El Profesor Oak te permitirá elegir uno de entre tres Pokémon iniciales (Bulbasaur, Charmander y Squirtle) para iniciar la aventura y poder combatir contra otros Pokémon salvajes y entrenadores, derrotando lideres de gimnasio hasta conseguir las 8 medallas, y asi poder enfrentarse a la elite cuatro y volverse el campion de la region. Dentro de la aventura, el jugador deberá además hacer frente a un grupo de villanos conocidos como el Team Rocket liderados por el misterioso Giovanni quienes con sus ambiciosos planes amenazan el bienestar de las personas y los Pokémon de Kanto."
    },
    {
        "name": "Pokemon Oro/ Plata/ Cristsal ",
        "year": 2001,
        "director": "Satoshi Tajiri",
        "pic_sm": "Gens_02.jpg",
        "pic_lg": "Gena_02.png",
        "trailer": "https://www.youtube.com/watch?v=upDjb-WsBvo&ab_channel=PokemonOfficial100",
        "description": "Han pasado tres años desde la aventura de Pokémon Rojo y Azul y el Team Rocket ha regresado y va a volver a intentar conquistar el mundo. Durante la historia maquinarán perversos planes que más tarde el jugador tendrá que evitar que se lleven a cabo. Desde robar las colas de los Slowpoke en el Pozo Slowpoke hasta utilizar las ondas de radio para hacer evolucionar artificialmente a los Pokémon. El jugador, que se llama por defecto Oro, comenzará su aventura en Pueblo Primavera, donde elegirá uno de los tres Pokémon iniciales de Johto en el laboratorio del Profesor Elm. Después de escoger un Pokémon inicial Oro recibirá un encargo del profesor Elm para recoger un huevo Pokémon del Sr. Pokémon. Entonces conocerá al Profesor Oak que le entregará un Pokédex. Mientras Oro vuelve a Pueblo Primavera con el huevo será atacado por un misterioso entrenador. Al regresar al laboratorio descubre que ese entrenador ha robado uno de los Pokémon iniciales del Profesor Elm. Este entrenador se conoce por defecto como Plata. Durante el juego Oro se enfrentara a los planes del Team Rocket y también a Plata que lo irá retando conforme vaya avanzando la historia. Plata siempre robará el inicial que tenga ventaja sobre el que Oro eligió. Por ejemplo, si Oro elige a Chikorita, Plata elegirá a Cyndaquil."
    },
    {
        "name": "Pokemon rubi/ zafiro/ Esmeralda",
        "year": 2004,
        "director": "Junishi Masuda",
        "pic_sm": "Gens_03.jpg",
        "pic_lg": "Gena_03.png",
        "trailer": "https://www.youtube.com/watch?v=1cvT_jF5NTU&ab_channel=carmen1994able",
        "description": "La historia transcurre en la región de Hoenn. En la historia llega a Hoenn un chico/chica (Bruno/Aura) nuevo en la región desde Johto junto con su familia siendo su padre puesto como líder de gimnasio de ciudad Petalia, él/ella vive junto con su madre en Villa Raíz, en la cual vive el Profesor Abedul con su hijo/a. Un día, el profesor Abedul es atacado por un Poochyena, del que lo salva por Bruno/Aura. El Profesor, como agradecimiento, le regala el Pokémon con el que fue salvado (los Pokémon iniciales Mudkip, Torchic o Treecko) y le pide que vaya a buscar a su hijo/a para poder entregarles la Pokedex. Bruno/Aura van en busca del hijo/a del profesor, que reta a una batalla a Bruno/Aura teniendo el Pokémon inicial cuyo tipo gana al Pokémon elegido por Bruno/Aura. Luego de la batalla, él/ella le pide una carrera para ver quien llega primero a Villa Raíz. Tras entregarles la Pokédex el/la hijo/a del profesor, se van. Antes de salir de Villa Raíz, la madre de Bruno/Aura le regala los zapatos para correr diciéndole que su padre Norman le espera en el gimnasio, y Bruno/Aura marcha a su encuentro. Al llegar al Gimnasio Petalia, su padre Norman le explica a Bruno/Aura que necesita las 8 medallas de Hoenn para poder entrar en la Liga Pokémon. Más tarde llega un chico llamado Blasco, que pide a Norman que le enseñe cómo capturar un Pokémon y éste acepta. Seguidamente le da un Zigzagoon y se encaminan él y Bruno/Aura a buscar al Pokémon, capturando a un Ralts (prácticamente lo haces todo tú, es decir, tú dices qué ataques usa, como si lucharas tú solo/a), siendo como su Pokémon inicial. Acto seguido, regresan al gimnasio, y es ahí cuando Norman le dice a Bruno/Aura que no podrá retarlo hasta haber conseguido 4 medallas. La aventura continua por el resto de Hoenn. Después de conseguir las siguientes dos medallas, se descubren los planes del Equipo Magma/Aqua, que consisten en despertar a Groudon/Kyogre... pero son detenidos por Bruno/Aura. El protagonista consigue la última medalla y, finalmente, se dirige a la Liga Pokémon, donde logra vencer al Alto Mando y llegar a enfrentarse al Campeón Pokémon, que resulta ser Máximo. La batalla de Bruno/Aura contra el Campeón Máximo tiene lugar, concluyendo con la victoria de Bruno/Aura, que se hace con el título de nuevo Campeón/Campeona."
    },
    {
        "name": "Pokemon Diamante/ Perla/ PLatino",
        "year": 2007,
        "director": "Junishi Masuda",
        "pic_sm": "Gens_04.jpg",
        "pic_lg": "Gena_04.png",
        "trailer": "https://www.youtube.com/watch?v=CryM43M1lpg&ab_channel=PokemonOfficial100",
        "description": "El juego nos sitúa en Sinnoh, una región aislada de todas las anteriores donde encontraremos nuevos Pokémon. Al comienzo, gracias al Profesor Serbal obtendremos nuestro primer Pokémon, a elegir entre Turtwig (Pokémon de tipo planta), Chimchar (Pokémon de tipo fuego) y Piplup (Pokémon de tipo agua). A partir de ese momento, el objetivo será el mismo que en el resto de RPG's Pokémon, obtener tantos Pokémon como puedas para vencer a los Líderes de Gimnasio que aguardan en la región hasta llegar al Alto Mando y vencer a la campeona."
    },
    {
        "name": "Pokemon Blanco/ Negro",
        "year": 2011,
        "director": "Junishi Masuda",
        "pic_sm": "Gens_05.jpg",
        "pic_lg": "Gena_05.png",
        "trailer": "https://www.youtube.com/watch?v=PrYtQMfcyKA&ab_channel=GiancarloParimango",
        "description": "El jugador comienza su viaje en la región de Teselia. Allí, se encontrarán con el Profesor Encina, quien les entregará su primer Pokémon para comenzar su aventura. A lo largo del juego, el jugador deberá enfrentarse a ocho líderes de gimnasio y derrotar al Alto Mando de la Liga Pokémon para convertirse en el Campeón de la Región de Teselia. En el camino, también se encontrarán con el Equipo Plasma, una organización que busca liberar a los Pokémon de sus entrenadores. Antes de poder desafiar a la Liga, el jugador debe haber obtenido las ocho medallas de gimnasio al derrotar a los líderes de cada uno de ellos. Una vez que se hayan obtenido todas las medallas, el jugador podrá acceder a la Liga Pokémon."
    },
    {
        "name": "Pokemon Blanco 2/ Negro 2",
        "year": 2012,
        "director": "Junishi Masuda",
        "pic_sm": "Gens_051.jpg",
        "pic_lg": "Gena_051.png",
        "trailer": "https://www.youtube.com/watch?v=BAInQ2nBZKg&ab_channel=Gigatitan",
        "description": "Los jugadores regresan a la región de Teselia después de dos años desde los eventos del juego original. Una vez más, el Equipo Plasma amenaza con desatar el caos en la región y es tarea del jugador detenerlos. El Equipo Plasma ha regresado y es aún más peligroso que antes. Liderados por Ghetsis, quien se encuentra escondido en algún lugar desconocido, el Equipo Plasma busca apoderarse de la región de Teselia una vez más. En esta ocasión, el Equipo Plasma ha dividido en dos facciones: el Equipo Plasma Neo y el Equipo Plasma antiguo. El Equipo Plasma Neo está liderado por Colress, un científico que utiliza tecnología avanzada para mejorar y controlar a los Pokémon. Mientras tanto, el Equipo Plasma antiguo está liderado por Ghetsis y sus seguidores más leales, que buscan restablecer el Equipo Plasma original y llevar a cabo su plan de dominar a los Pokémon. El jugador se enfrentará a ambos equipos durante su aventura, y deberá detener a ambos para proteger a los Pokémon y a la región de Teselia. A medida que avanza la trama, el jugador descubre más sobre los planes de ambos equipos y su conexión con los eventos del juego original de Pokémon Blanco y Negro. El jugador, como el héroe de la región, debe unirse a otros entrenadores y líderes de gimnasio para detener al Equipo Plasma. En el camino, también se encontrarán con N, el héroe anterior que ahora busca unir a humanos y Pokémon en lugar de liberarlos."
    },
    {
        "name": "Pokemon X/ Y",
        "year": 2013,
        "director": "Junishi Masuda",
        "pic_sm": "Gens_06.jpg",
        "pic_lg": "Gena_06.png",
        "trailer": "https://www.youtube.com/watch?v=icjkBxxOmkw&ab_channel=NintendoEspa%C3%B1a",
        "description": "Los jugadores son transportados a la hermosa región de Kalos, un lugar inspirado en la región de Francia. En este juego, el jugador comienza su aventura en la pequeña ciudad de Vaniville, donde conocerán al Profesor Sycamore y recibirán su primer Pokémon. El jugador deberá viajar a través de la región de Kalos, enfrentándose a ocho líderes de gimnasio y recolectando medallas para poder desafiar a la Liga Pokémon. A medida que el jugador progresa en la historia, también se encontrarán con el Equipo Flare, una organización malvada que busca controlar la región de Kalos con sus planes egoístas. Además de la trama principal, los jugadores pueden participar en una variedad de actividades en la región de Kalos, incluyendo el nuevo sistema de megaevolución que permite a ciertos Pokémon alcanzar nuevas formas poderosas. También se presentan nuevos Pokémon, algunos de los cuales tienen tipos y habilidades únicas. La historia de Pokémon X e Y también presenta la historia de la guerra entre los antiguos reyes Pokémon y el legendario Pokémon Xerneas y Yveltal, que dan nombre a los juegos. El jugador descubre que su papel en la historia es vital para detener la amenaza del Equipo Flare y evitar la destrucción de Kalos. En resumen, Pokémon X e Y es una emocionante aventura en la que el jugador debe salvar la región de Kalos de la amenaza del Equipo Flare y descubrir los secretos ocultos de los Pokémon legendarios Xerneas y Yveltal. Con nuevos Pokémon, el sistema de megaevolución y una trama interesante, X e Y ofrecen una experiencia de juego emocionante para los fanáticos de Pokémon."
    },
    {
        "name": "Pokemon Sol/ Luna/ Ultra Sol/ Ultra Luna",
        "year": 2016,
        "director": "Shigeru Ohmori",
        "pic_sm": "Gens_07.jpg",
        "pic_lg": "Gena_07.png",
        "trailer": "https://www.youtube.com/watch?v=Z6XVV-QRixQ&ab_channel=NintendoEspa%C3%B1a",
        "description": "Los jugadores son transportados a la hermosa región de Alola, un archipiélago tropical que está inspirado en la región de Hawái. Como entrenador Pokémon, el jugador comienza su aventura en la isla de Melemele, donde conocerán al Profesor Kukui y recibirán su primer Pokémon. A diferencia de los juegos anteriores, Sol y Luna tienen un enfoque más narrativo, donde el jugador se ve envuelto en una historia que involucra a un grupo malvado llamado el Equipo Skull y un misterioso Pokémon legendario conocido como Necrozma. Mientras el jugador viaja por Alola, se encontrará con nuevos Pokémon que son nativos de la región y tendrá que enfrentarse a los líderes de los Kahuna, los guardianes de cada isla de la región. A medida que el jugador progresa en la historia, se encontrarán con la Aether Foundation, una organización benéfica que protege a los Pokémon heridos y enfermos, pero que tiene secretos oscuros. El Equipo Skull, un grupo de delincuentes que desean convertirse en los líderes de Alola, será un obstáculo constante para el jugador en su viaje, y tendrán que enfrentarlos en varias ocasiones. Además, el jugador también se encontrará con la Ultra Dimensión, donde deberá salvar a la región de una amenaza más grande. En resumen, Pokémon Sol y Luna es una aventura emocionante en la que el jugador debe salvar la región de Alola de la amenaza del Equipo Skull y descubrir los secretos ocultos de la Aether Foundation y la Ultra Dimensión. Con nuevos Pokémon y un enfoque más narrativo, Sol y Luna ofrecen una experiencia de juego única y emocionante."
    },
    {
        "name": "Pokemon Espada/ Escudo",
        "year": 2019,
        "director": "Shigeru Ohmori",
        "pic_sm": "Gens_08.jpg",
        "pic_lg": "Gena_08.png",
        "trailer": "https://www.youtube.com/watch?v=wLbyvPODSc4&ab_channel=NintendoEspa%C3%B1a",
        "description": "En Pokémon Espada y Escudo, te unes a un joven y valiente entrenador Pokémon que ha llegado a la región de Galar para cumplir su sueño de convertirse en el campeón de la Liga de Galar. Junto con su compañero Pokémon, emprenden una emocionante aventura para desafiar a los líderes de gimnasio de la región y competir en la Liga. Pero la región de Galar no es un lugar tranquilo, ya que el equipo de villanos conocido como Team Yell amenaza la paz de la región. A medida que nuestro protagonista y su compañero viajan por Galar, deben enfrentarse a los miembros del Team Yell y descubrir sus verdaderas intenciones. Además, a lo largo de su viaje, nuestros héroes descubren que hay Pokémon legendarios ocultos en la región, y no faltan los que buscan capturarlos para sus propios fines. Nuestro protagonista y su equipo deben proteger a estos Pokémon legendarios y evitar que caigan en manos equivocadas."
    },
    {
        "name": "Pokemon Escarlata/ Violeta",
        "year": 2022,
        "director": "Shigeru Ohmori",
        "pic_sm": "Gens_09.jpg",
        "pic_lg": "Gena_09.png",
        "trailer": "https://www.youtube.com/watch?v=SxwOJi2dd4c&ab_channel=GameSpot",
        "description": "La región de Paldea cuenta con grandes paisajes y ciudades vibrantes. La aventura del entrenador comienza inscribiéndose en una academia ubicada en el corazón de la región, donde conocerás a tus profesores y compañeros. El Director Clavel dará inicio a la primera tarea: una caza de tesoros, donde quizá puedas encontrar algo que atesores por siempre. Elegirás a tu primer compañero: Sprigatito, el Pokémon Gato Planta; Fuecoco, el Pokémon Fuegodrilo; o Quaxly, el Pokémon Patito. Además, los Pokémon legendarios Koraidon y Miraidon te ayudarán durante tus viajes para poder explorar cada lugar. Podrás recorrer Paldea de la manera que prefieras; a dónde quieras ir dependerá completamente de ti, e incluso acompañado por hasta otros 3 jugadores a través de la conexión inalámbrica. Hay 8 gimnasios Pokémon a los que te enfrentarás en el orden que elijas. También te infiltrarás en el escondite del Equipo Star, derrotando a todos en tu camino para evitar que interrumpan las actividades de la academia.¿ Dominar la teracristalización será clave para dominar las batallas en esta región. Este fenómeno sólo ocurre en Paldea, y provoca que los Pokémon brillen como gemas; también hace más fuertes sus movimientos. Todos los Pokémon pueden usar la teracristalización, y algunos puede que incluso cambien sus tipos elementales al hacerlo. Estos Pokémon especiales pueden ser capturados en teraincursiones que pueden ser desafiadas junto con otros tres jugadores."
    }
]
